{
    "软件理论": {
        "软件生命周期？": "项目计划，需求分析，软件设计，程序编码，软件测试，运维",
        "软件测试发展？": "以调试为主，以证明为主，以破坏为主，以评估为主",
        "软件测试目的？": "证明，检测，预防",
        "软件体系的结构？": "C/S，B/S",
        "软件测试的原则？": "测试以用户需求为准，测试要早介入，测试无法穷举，避免开发者自测，杀虫剂悖论，群集效应，不存在缺陷的谬论",
        "软件测试模型？": "V型，W型，H型，X型，敏捷测试",
        "软件缺陷是什么？": "软件产品不符合用户的需求",
        "软件缺陷产生的原因？": "缺乏有效的沟通，软件过于复杂，编码错误，需求的变更，时间压力，开发人员过于自信",
        "软件缺陷的种类？": "遗漏，错误，冗余，不满意",
        "什么是测试用例？": "软件产品测试任务的描述",
        "测试用例重要吗？为什么？": "避免程序漏测，测试进度把控，度量指标，缺陷的依据，降低管理成本",
        "编写测试用例的重要点?": "用例编号，用例标题，用例优先级，前提条件，测试数据，操作步骤，预期结果，用例状态",
        "测试用例遵循的5个原则？": "准确，清晰，简洁，完整，一致"

    },
    "软件测试方法": {
        "软件测试执行阶段分为？": "白盒测试，黑盒测试，灰盒测试",
        "软件测试执行状态分为？": "静态测试，动态测试",
        "软件测试执行行为分为？": "手动测试，自动测试",
        "白盒测试是什么？": "结构测试或逻辑驱动测试，是针对被测单元内部是如何工作的测试",
        "白盒测试静态分析方法是什么？": "控制流分析，数据流分析，信息流分析，代码评审",
        "白盒测试动态分析方法是什么？": "程序插桩，逻辑覆盖率，接口测试，性能分析，内存分析",
        "白盒测试的逻辑覆盖包括？": "语句覆盖，判定覆盖，条件覆盖，条件组合覆盖，路径覆盖",
        "黑盒测试是什么？": "称为功能测试。重点测试输入和输出的正确性，不关注程序内部结构和逻辑，",
        "黑盒测试重点是什么？": "功能的完整性，界面的正确性，数据结构，性能符合性，错误的明确性",
        "黑盒的测试方法？": "功能性，安全性，兼容性，稳定性，可靠性",
        "测试用例设计方法？": "等价类划分，边界值分析，因果图分析，正交试验，流程分析，状态迁移，异常分析，错误推测",
        "异常分析方法？": "不按正常的流程运行，删除和修改配置文件，添加特殊符号，制造数据库死机，增加服务器资源的使用情况，进行断电测试",
        "静态测试方法?": "代码检查,静态结构分析，代码质量度量"
    },
    "软件测试工具": {
        "配置管理工具?": "SVN",
        "缺陷管理工具？": "JIRA,BugFree,禅道",
        "性能测试工具？": "vmstat,iostat,Loadrunner,Jmeter",
        "什么是性能测试？": "性能测试主要在一定软件和硬件及网络环境下，对系统的各项指标进行测试，主要检测是否满足特定的性能需求。",
        "性能测试重要性？": "评估系统的处理能力，评估系统的稳定性，评估系统存在的弱点",
        "性能测试的分类？": "并发测试，负载测试，压力测试，容量测试，配置测试，基准测试",
        "性能测试指标？": "并发数，响应时间，吞吐量，TPS，点击率，资源利用率",
        "性能测试流程？": "制定性能测试计划，设计性能测试，执行负载测试，分析优化性能，评估并生成报告",
        "接口测试重点？": "返回状态是否正确，检查返回数据的正确性，边界和异常扩展检查，接口之间的关联测试",
        "接口测试工具": "Postman，Jmeter，HTTPrequest，SoapUI",
        "抓包测试工具": "HTTPWatch"
    }
}
