{
    "软件理论": {
        "软件生命周期？": 1,
        "软件测试发展？": 1,
        "软件测试目的？": 1,
        "软件体系的结构？": 2,
        "软件测试的原则？": 6,
        "软件测试模型？": 2,
        "软件缺陷是什么？": 1,
        "软件缺陷产生的原因？": 10,
        "软件缺陷的种类？": 2,
        "什么是测试用例？": 1,
        "测试用例重要吗？为什么？": 1,
        "编写测试用例的重要点?": 1,
        "测试用例遵循的5个原则？": 3
    },
    "软件测试方法": {
        "软件测试执行阶段分为？": 1,
        "软件测试执行状态分为？": 1,
        "软件测试执行行为分为？": 1,
        "白盒测试是什么？": 1,
        "白盒测试静态分析方法是什么？": 1,
        "白盒测试动态分析方法是什么？": 1,
        "白盒测试的逻辑覆盖包括？": 1,
        "黑盒测试是什么？": 1,
        "黑盒测试重点是什么？": 1,
        "黑盒的测试方法？": 1,
        "测试用例设计方法？": 1,
        "异常分析方法？": 1,
        "静态测试方法?": 1
    },
    "软件测试工具": {
        "配置管理工具?": 1,
        "缺陷管理工具？": 1,
        "性能测试工具？": 1,
        "什么是性能测试？": 1,
        "性能测试重要性？": 1,
        "性能测试的分类？": 1,
        "性能测试指标？": 1,
        "性能测试流程？": 1,
        "接口测试重点？": 1,
        "接口测试工具": 2,
        "抓包测试工具": 1
    }
}