{
    "软件理论":{
        "软件生命周期？":"计划，分析，设计，编码，测试，运维",
        "软件测试发展？":"调试，证明，破坏，评估",
        "软件测试目的？":"证明，检测，预防",
        "软件体系的结构？":"C/S，B/S",
        "软件测试的原则？":"用户需求，早，穷举，自测，杀虫剂悖论，群集效应，不存在缺陷",
        "软件测试模型？":"V型，W型，H型，X型，敏捷测试",
        "软件缺陷是什么？":"不符合用户的需求",
        "软件缺陷产生的原因？":"有效沟通，复杂，错误，变更，时间压力，过于自信",
        "软件缺陷的种类？":"遗漏，错误，冗余，不满意",
        "什么是测试用例？":"测试任务的描述",
        "测试用例重要吗？为什么？":"程序漏测，进度把控，度量指标，缺陷依据，管理成本",
        "编写测试用例的重要点?":"用例编号，用例标题，用例优先级，前提条件，测试数据，操作步骤，预期结果，用例状态",
        "测试用例遵循的5个原则？":"准确/正确，清晰，简洁，完整，一致"

    },
    "软件测试方法":{
        "软件测试执行阶段分为？": "白盒测试，黑盒测试，灰盒测试",
        "软件测试执行状态分为？": "静态测试，动态测试",
        "软件测试执行行为分为？": "手动测试，自动测试",
        "白盒测试是什么？":"结构，逻辑，内部",
        "白盒测试静态分析方法是什么？":"控制流分析，数据流分析，信息流分析，代码评审",
        "白盒测试动态分析方法是什么？":"插桩，覆盖率，接口测试，性能分析，内存分析",
        "白盒测试的逻辑覆盖包括？":"语句覆盖，判定覆盖，条件覆盖，条件组合覆盖，路径覆盖",
        "黑盒测试是什么？":"功能测试。输入和输出，程序内部结构和逻辑，",
        "黑盒测试重点是什么？":"完整性，正确性，数据结构，符合性，明确性"
    },
    "软件测试工具": {
        "配置管理工具?": "SVN",
        "缺陷管理工具？": "JIRA,BugFree,禅道",
        "性能测试工具？": "vmstat,iostat,Loadrunner,Jmeter",
        "什么是性能测试？": "性能测试主要在一定软件和硬件及网络环境下，对系统的各项指标进行测试，主要检测是否满足特定的性能需求。",
        "性能测试重要性？": "处理，稳定性，弱点",
        "性能测试的分类？": "并发，负载，压力，容量，配置，基准",
        "性能测试指标？": "并发数，响应时间，吞吐量，TPS，点击率，资源利用率",
        "性能测试流程？": "测试计划，设计性能，执行负载，分析性能，评估报告",
        "接口测试重点？": "返回状态是否正确，检查返回数据的正确性，边界和异常扩展检查，接口之间的关联测试",
        "接口测试工具": "Postman，Jmeter，HTTPrequest，SoapUI",
        "抓包测试工具": "HTTPWatch"
    }

}